tap "eth-p/software"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
brew "python@3.12"
brew "awscli"
brew "bat"
brew "glib"
brew "cairo"
brew "cocoapods"
brew "eza"
brew "git"
brew "icu4c@76"
brew "harfbuzz"
brew "helm"
brew "htop"
brew "httpie"
brew "jq"
brew "kubernetes-cli"
brew "kustomize"
brew "less"
brew "lsd"
brew "mackup"
brew "mas"
brew "openjdk"
brew "maven"
brew "neofetch"
brew "neovim"
brew "node"
brew "openjdk@17"
brew "python@3.11"
brew "ripgrep"
brew "stow"
brew "tmux"
brew "tree"
brew "wget"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "hashicorp/tap/terraform"
cask "alt-tab"
cask "bartender"
cask "caffeine"
cask "docker"
cask "font-fira-code-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monaspace"
cask "font-monaspace-nerd-font"
cask "iterm2"
cask "itsycal"
cask "logi-options+"
cask "pgadmin4"
cask "rectangle"
cask "stats"
cask "sublime-text"
cask "wezterm"
mas "Be Focused", id: 973134470
mas "GIPHY CAPTURE", id: 668208984
mas "Kindle", id: 302584613
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft To Do", id: 1274495053
mas "The Unarchiver", id: 425424353
vscode "alexdauenhauer.catppuccin-noctis"
vscode "alexkrechik.cucumberautocomplete"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "angular.ng-template"
vscode "asciidoctor.asciidoctor-vscode"
vscode "aws-scripting-guy.cform"
vscode "batisteo.vscode-django"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "catppuccin.catppuccin-vsc"
vscode "compilenix.vscode-zonefile"
vscode "danielthielking.aws-cloudformation-yaml"
vscode "deagrut.pep8-asm"
vscode "dnicolson.binary-plist"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "edwinkofler.vscode-assorted-languages"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-diff"
vscode "formulahendry.code-runner"
vscode "github.github-vscode-theme"
vscode "google.geminicodeassist"
vscode "googlecloudtools.cloudcode"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "idleberg.applescript"
vscode "jebbs.plantuml"
vscode "johnpapa.winteriscoming"
vscode "kddejong.vscode-cfn-lint"
vscode "kevinrose.vsc-python-indent"
vscode "luisalvesmartins.markdown-code-to-png"
vscode "lunuan.kubernetes-templates"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-de"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "nhoizey.gremlins"
vscode "njpwerner.autodocstring"
vscode "randomfractalsinc.geo-data-viewer"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "robole.snippets-ranger"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "tberman.json-schema-validator"
vscode "tomoyukim.vscode-mermaid-editor"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vstirbu.vscode-mermaid-preview"
vscode "wholroyd.jinja"
vscode "withfig.fig"
vscode "xabikos.javascriptsnippets"
vscode "xcad2k.vscode-thedigitallife"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
vscode "zhouronghui.propertylist"
