tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
brew "age"
brew "pycparser"
brew "cffi"
brew "ansible"
brew "webp"
brew "arp-scan"
brew "python@3.11"
brew "awscli"
brew "bat"
brew "black"
brew "gettext"
brew "cairo"
brew "docutils"
brew "dos2unix"
brew "libgit2"
brew "exa"
brew "exiftool"
brew "libtool"
brew "freetds"
brew "gd"
brew "gdk-pixbuf"
brew "ggshield"
brew "openjpeg"
brew "ghostscript"
brew "glab"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "go"
brew "netpbm"
brew "gts"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "graphviz"
brew "helm"
brew "htop"
brew "httpie"
brew "shared-mime-info"
brew "libheif"
brew "libraw"
brew "imagemagick"
brew "iperf3"
brew "ipython"
brew "jq"
brew "node"
brew "jupyterlab"
brew "kubernetes-cli"
brew "less"
brew "libpq"
brew "mackup"
brew "mas"
brew "maven"
brew "mypy"
brew "tree-sitter"
brew "neovim"
brew "openshift-cli"
brew "php"
brew "prettier"
brew "pydocstyle"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python-lsp-server"
brew "sops"
brew "tmux"
brew "trash"
brew "tree"
brew "wget"
brew "xclip"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "eth-p/software/bat-extras"
cask "alfred"
cask "authy"
cask "caffeine"
cask "dbngin"
cask "deepl"
cask "deskpad"
cask "discord"
cask "docker"
cask "fig"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-lato"
cask "font-open-sans"
cask "font-roboto"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "font-source-sans-pro"
cask "font-source-serif-pro"
cask "github"
cask "gitkraken"
cask "imageoptim"
cask "insomnia"
cask "iterm2"
cask "keepassxc"
cask "obsidian"
cask "onedrive"
cask "openvpn-connect"
cask "postman"
cask "qlmarkdown"
cask "quicklook-json"
cask "rectangle"
cask "shottr"
cask "signal"
cask "spotify"
cask "tableplus"
cask "the-unarchiver"
cask "todoist"
cask "transmit"
cask "vlc"
cask "whatsapp"
mas "Kindle", id: 405399194
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft To Do", id: 1274495053
mas "The Unarchiver", id: 425424353
vscode "alexkrechik.cucumberautocomplete"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "angular.ng-template"
vscode "asciidoctor.asciidoctor-vscode"
vscode "aws-scripting-guy.cform"
vscode "batisteo.vscode-django"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "danielthielking.aws-cloudformation-yaml"
vscode "deagrut.pep8-asm"
vscode "dnicolson.binary-plist"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "googlecloudtools.cloudcode"
vscode "hediet.vscode-drawio"
vscode "idleberg.applescript"
vscode "jebbs.plantuml"
vscode "kddejong.vscode-cfn-lint"
vscode "kevinrose.vsc-python-indent"
vscode "luisalvesmartins.markdown-code-to-png"
vscode "lunuan.kubernetes-templates"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "nhoizey.gremlins"
vscode "njpwerner.autodocstring"
vscode "randomfractalsinc.geo-data-viewer"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
vscode "tberman.json-schema-validator"
vscode "tomoyukim.vscode-mermaid-editor"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-maven"
vscode "vstirbu.vscode-mermaid-preview"
vscode "wholroyd.jinja"
vscode "withfig.fig"
vscode "xabikos.javascriptsnippets"
vscode "zainchen.json"
vscode "zhouronghui.propertylist"
